cma-1982/githubtest_190602/r_bsp/mcu/rx63t/register_access/iodefine_rx63th.h
enum enum_ier {
IER_BSC_BUSERR=0x02,
IER_FCU_FIFERR=0x02,IER_FCU_FRDYI=0x02,
IER_ICU_SWINT=0x03,
IER_CMT0_CMI0=0x03,
IER_CMT1_CMI1=0x03,
IER_CMT2_CMI2=0x03,
IER_CMT3_CMI3=0x03,
IER_USB0_D0FIFO0=0x04,IER_USB0_D1FIFO0=0x04,IER_USB0_USBI0=0x04,
IER_CAC_FERRF=0x04,IER_CAC_MENDF=0x04,IER_CAC_OVFF=0x04,
IER_RSPI0_SPRI0=0x04,IER_RSPI0_SPTI0=0x05,IER_RSPI0_SPII0=0x05,
IER_RSPI1_SPRI1=0x05,IER_RSPI1_SPTI1=0x05,IER_RSPI1_SPII1=0x05,
IER_CAN1_RXF1=0x05,IER_CAN1_TXF1=0x05,IER_CAN1_RXM1=0x05,IER_CAN1_TXM1=0x06,
IER_GPT7_GTCIA7=0x06,IER_GPT7_GTCIB7=0x06,IER_GPT7_GTCIC7=0x06,IER_GPT7_GTCIE7=0x06,IER_GPT7_GTCIV7=0x06,
IER_CMP_CMP4=0x06,IER_CMP_CMP5=0x06,IER_CMP_CMP6=0x07,
IER_DOC_DOPCF=0x07,
IER_DPC_RBI0=0x07,IER_DPC_RBI1=0x07,IER_DPC_RBI2=0x07,IER_DPC_RBI3=0x07,IER_DPC_RBI4=0x07,
IER_ICU_IRQ0=0x08,IER_ICU_IRQ1=0x08,IER_ICU_IRQ2=0x08,IER_ICU_IRQ3=0x08,IER_ICU_IRQ4=0x08,IER_ICU_IRQ5=0x08,IER_ICU_IRQ6=0x08,IER_ICU_IRQ7=0x08,
IER_USB_USBR0=0x0B,
IER_AD_ADI0=0x0C,
IER_S12AD_S12ADI0=0x0C,IER_S12AD_S12GBADI0=0x0C,
IER_S12AD1_S12ADI1=0x0D,IER_S12AD1_S12GBADI1=0x0D,
IER_ICU_GROUP0=0x0D,IER_ICU_GROUP12=0x0E,
IER_SCI12_SCIX0=0x0F,IER_SCI12_SCIX1=0x0F,IER_SCI12_SCIX2=0x0F,IER_SCI12_SCIX3=0x0F,
IER_MTU0_TGIA0=0x0F,IER_MTU0_TGIB0=0x0F,IER_MTU0_TGIC0=0x10,IER_MTU0_TGID0=0x10,IER_MTU0_TCIV0=0x10,IER_MTU0_TGIE0=0x10,IER_MTU0_TGIF0=0x10,
IER_MTU1_TGIA1=0x10,IER_MTU1_TGIB1=0x10,IER_MTU1_TCIV1=0x10,IER_MTU1_TCIU1=0x11,
IER_MTU2_TGIA2=0x11,IER_MTU2_TGIB2=0x11,IER_MTU2_TCIV2=0x11,IER_MTU2_TCIU2=0x11,
IER_MTU3_TGIA3=0x11,IER_MTU3_TGIB3=0x11,IER_MTU3_TGIC3=0x11,IER_MTU3_TGID3=0x12,IER_MTU3_TCIV3=0x12,
IER_MTU4_TGIA4=0x12,IER_MTU4_TGIB4=0x12,IER_MTU4_TGIC4=0x12,IER_MTU4_TGID4=0x12,IER_MTU4_TCIV4=0x12,
IER_MTU5_TGIU5=0x12,IER_MTU5_TGIV5=0x13,IER_MTU5_TGIW5=0x13,
IER_MTU6_TGIA6=0x13,IER_MTU6_TGIB6=0x13,IER_MTU6_TGIC6=0x13,IER_MTU6_TGID6=0x13,IER_MTU6_TCIV6=0x13,
IER_MTU7_TGIA7=0x14,IER_MTU7_TGIB7=0x14,IER_MTU7_TGIC7=0x14,IER_MTU7_TGID7=0x14,IER_MTU7_TCIV7=0x14,
IER_POE_OEI1=0x14,IER_POE_OEI2=0x14,IER_POE_OEI3=0x15,IER_POE_OEI4=0x15,IER_POE_OEI5=0x15,
IER_CMP_CMP0=0x15,IER_CMP_CMP1=0x15,IER_CMP_CMP2=0x15,
IER_GPT4_GTCIA4=0x15,IER_GPT4_GTCIB4=0x15,IER_GPT4_GTCIC4=0x16,IER_GPT4_GTCIE4=0x16,IER_GPT4_GTCIV4=0x16,IER_GPT4_LOCOI4=0x16,
IER_GPT5_GTCIA5=0x16,IER_GPT5_GTCIB5=0x16,IER_GPT5_GTCIC5=0x16,IER_GPT5_GTCIE5=0x16,IER_GPT5_GTCIV5=0x17,
IER_GPT6_GTCIA6=0x17,IER_GPT6_GTCIB6=0x17,IER_GPT6_GTCIC6=0x17,IER_GPT6_GTCIE6=0x17,IER_GPT6_GTCIV6=0x17,
IER_RIIC1_EEI1=0x17,IER_RIIC1_RXI1=0x17,IER_RIIC1_TXI1=0x18,IER_RIIC1_TEI1=0x18,
IER_RIIC0_EEI0=0x18,IER_RIIC0_RXI0=0x18,IER_RIIC0_TXI0=0x18,IER_RIIC0_TEI0=0x18,
IER_DMAC_DMAC0I=0x18,IER_DMAC_DMAC1I=0x18,IER_DMAC_DMAC2I=0x19,IER_DMAC_DMAC3I=0x19,
IER_SCI0_RXI0=0x1A,IER_SCI0_TXI0=0x1A,IER_SCI0_TEI0=0x1B,
IER_SCI1_RXI1=0x1B,IER_SCI1_TXI1=0x1B,IER_SCI1_TEI1=0x1B,
IER_SCI2_RXI2=0x1B,IER_SCI2_TXI2=0x1B,IER_SCI2_TEI2=0x1B,
IER_SCI3_RXI3=0x1B,IER_SCI3_TXI3=0x1C,IER_SCI3_TEI3=0x1C,
IER_GPT0_GTCIA0=0x1C,IER_GPT0_GTCIB0=0x1C,IER_GPT0_GTCIC0=0x1C,IER_GPT0_GTCIE0=0x1C,IER_GPT0_GTCIV0=0x1C,IER_GPT0_LOCOI0=0x1C,
IER_GPT1_GTCIA1=0x1D,IER_GPT1_GTCIB1=0x1D,IER_GPT1_GTCIC1=0x1D,IER_GPT1_GTCIE1=0x1D,IER_GPT1_GTCIV1=0x1D,
IER_GPT2_GTCIA2=0x1D,IER_GPT2_GTCIB2=0x1D,IER_GPT2_GTCIC2=0x1E,IER_GPT2_GTCIE2=0x1E,IER_GPT2_GTCIV2=0x1E,
IER_GPT3_GTCIA3=0x1E,IER_GPT3_GTCIB3=0x1E,IER_GPT3_GTCIC3=0x1E,IER_GPT3_GTCIE3=0x1E,IER_GPT3_GTCIV3=0x1F,
IER_SCI12_RXI12=0x1F,IER_SCI12_TXI12=0x1F,IER_SCI12_TEI12=0x1F
};

enum enum_ipr {
IPR_BSC_BUSERR=0,
IPR_FCU_FIFERR=1,IPR_FCU_FRDYI=2,
IPR_ICU_SWINT=3,
IPR_CMT0_CMI0=4,
IPR_CMT1_CMI1=5,
IPR_CMT2_CMI2=6,
IPR_CMT3_CMI3=7,
IPR_USB0_D0FIFO0=33,IPR_USB0_D1FIFO0=34,IPR_USB0_USBI0=35,
IPR_CAC_FERRF=36,IPR_CAC_MENDF=36,IPR_CAC_OVFF=36,
IPR_RSPI0_SPRI0=39,IPR_RSPI0_SPTI0=39,IPR_RSPI0_SPII0=39,
IPR_RSPI1_SPRI1=42,IPR_RSPI1_SPTI1=42,IPR_RSPI1_SPII1=42,
IPR_CAN1_RXF1=45,IPR_CAN1_TXF1=45,IPR_CAN1_RXM1=45,IPR_CAN1_TXM1=45,
IPR_GPT7_GTCIA7=49,IPR_GPT7_GTCIB7=49,IPR_GPT7_GTCIC7=49,IPR_GPT7_GTCIE7=52,IPR_GPT7_GTCIV7=52,
IPR_CMP_CMP4=54,IPR_CMP_CMP5=55,IPR_CMP_CMP6=56,
IPR_DOC_DOPCF=57,
IPR_DPC_RBI0=58,IPR_DPC_RBI1=59,IPR_DPC_RBI2=60,IPR_DPC_RBI3=61,IPR_DPC_RBI4=62,
IPR_ICU_IRQ0=64,IPR_ICU_IRQ1=65,IPR_ICU_IRQ2=66,IPR_ICU_IRQ3=67,IPR_ICU_IRQ4=68,IPR_ICU_IRQ5=69,IPR_ICU_IRQ6=70,IPR_ICU_IRQ7=71,
IPR_USB_USBR0=90,
IPR_AD_ADI0=98,
IPR_S12AD_S12ADI0=102,IPR_S12AD_S12GBADI0=103,
IPR_S12AD1_S12ADI1=104,IPR_S12AD1_S12GBADI1=105,
IPR_ICU_GROUP0=106,IPR_ICU_GROUP12=114,
IPR_SCI12_SCIX0=122,IPR_SCI12_SCIX1=122,IPR_SCI12_SCIX2=122,IPR_SCI12_SCIX3=122,
IPR_MTU0_TGIA0=126,IPR_MTU0_TGIB0=126,IPR_MTU0_TGIC0=126,IPR_MTU0_TGID0=126,IPR_MTU0_TCIV0=130,IPR_MTU0_TGIE0=130,IPR_MTU0_TGIF0=130,
IPR_MTU1_TGIA1=133,IPR_MTU1_TGIB1=133,IPR_MTU1_TCIV1=135,IPR_MTU1_TCIU1=135,
IPR_MTU2_TGIA2=137,IPR_MTU2_TGIB2=137,IPR_MTU2_TCIV2=139,IPR_MTU2_TCIU2=139,
IPR_MTU3_TGIA3=141,IPR_MTU3_TGIB3=141,IPR_MTU3_TGIC3=141,IPR_MTU3_TGID3=141,IPR_MTU3_TCIV3=145,
IPR_MTU4_TGIA4=146,IPR_MTU4_TGIB4=146,IPR_MTU4_TGIC4=146,IPR_MTU4_TGID4=146,IPR_MTU4_TCIV4=150,
IPR_MTU5_TGIU5=151,IPR_MTU5_TGIV5=151,IPR_MTU5_TGIW5=151,
IPR_MTU6_TGIA6=154,IPR_MTU6_TGIB6=154,IPR_MTU6_TGIC6=154,IPR_MTU6_TGID6=154,IPR_MTU6_TCIV6=158,
IPR_MTU7_TGIA7=161,IPR_MTU7_TGIB7=161,IPR_MTU7_TGIC7=163,IPR_MTU7_TGID7=163,IPR_MTU7_TCIV7=165,
IPR_POE_OEI1=166,IPR_POE_OEI2=166,IPR_POE_OEI3=166,IPR_POE_OEI4=166,IPR_POE_OEI5=166,
IPR_CMP_CMP0=171,IPR_CMP_CMP1=172,IPR_CMP_CMP2=173,
IPR_GPT4_GTCIA4=174,IPR_GPT4_GTCIB4=174,IPR_GPT4_GTCIC4=174,IPR_GPT4_GTCIE4=177,IPR_GPT4_GTCIV4=177,IPR_GPT4_LOCOI4=177,
IPR_GPT5_GTCIA5=180,IPR_GPT5_GTCIB5=180,IPR_GPT5_GTCIC5=180,IPR_GPT5_GTCIE5=183,IPR_GPT5_GTCIV5=183,
IPR_GPT6_GTCIA6=185,IPR_GPT6_GTCIB6=185,IPR_GPT6_GTCIC6=185,IPR_GPT6_GTCIE6=188,IPR_GPT6_GTCIV6=188,
IPR_RIIC1_EEI1=190,IPR_RIIC1_RXI1=190,IPR_RIIC1_TXI1=190,IPR_RIIC1_TEI1=190,
IPR_RIIC0_EEI0=194,IPR_RIIC0_RXI0=194,IPR_RIIC0_TXI0=194,IPR_RIIC0_TEI0=194,
IPR_DMAC_DMAC0I=198,IPR_DMAC_DMAC1I=199,IPR_DMAC_DMAC2I=200,IPR_DMAC_DMAC3I=201,
IPR_SCI0_RXI0=214,IPR_SCI0_TXI0=214,IPR_SCI0_TEI0=214,
IPR_SCI1_RXI1=217,IPR_SCI1_TXI1=217,IPR_SCI1_TEI1=217,
IPR_SCI2_RXI2=220,IPR_SCI2_TXI2=220,IPR_SCI2_TEI2=220,
IPR_SCI3_RXI3=223,IPR_SCI3_TXI3=223,IPR_SCI3_TEI3=223,
IPR_GPT0_GTCIA0=226,IPR_GPT0_GTCIB0=226,IPR_GPT0_GTCIC0=226,IPR_GPT0_GTCIE0=229,IPR_GPT0_GTCIV0=229,IPR_GPT0_LOCOI0=229,
IPR_GPT1_GTCIA1=232,IPR_GPT1_GTCIB1=232,IPR_GPT1_GTCIC1=232,IPR_GPT1_GTCIE1=235,IPR_GPT1_GTCIV1=235,
IPR_GPT2_GTCIA2=238,IPR_GPT2_GTCIB2=238,IPR_GPT2_GTCIC2=238,IPR_GPT2_GTCIE2=241,IPR_GPT2_GTCIV2=241,
IPR_GPT3_GTCIA3=244,IPR_GPT3_GTCIB3=244,IPR_GPT3_GTCIC3=244,IPR_GPT3_GTCIE3=247,IPR_GPT3_GTCIV3=247,
IPR_SCI12_RXI12=250,IPR_SCI12_TXI12=250,IPR_SCI12_TEI12=250,
IPR_BSC_=0,
IPR_CMT0_=4,
IPR_CMT1_=5,
IPR_CMT2_=6,
IPR_CMT3_=7,
IPR_CAC_=36,
IPR_RSPI0_=39,
IPR_RSPI1_=42,
IPR_CAN1_=45,
IPR_DOC_=57,
IPR_AD_=98,
IPR_SCI12_SCIX_=122,
IPR_MTU1_TGI=133,
IPR_MTU1_TCI=135,
IPR_MTU2_TGI=137,
IPR_MTU2_TCI=139,
IPR_MTU3_TGI=141,
IPR_MTU4_TGI=146,
IPR_MTU5_=151,
IPR_MTU5_TGI=151,
IPR_MTU6_TGI=154,
IPR_POE_=166,
IPR_RIIC1_=190,
IPR_RIIC0_=194,
IPR_SCI0_=214,
IPR_SCI1_=217,
IPR_SCI2_=220,
IPR_SCI3_=223,
IPR_SCI12_=250
};

enum enum_grp {
GRP_SCI0_ERI0=12,GRP_SCI1_ERI1=12,GRP_SCI2_ERI2=12,GRP_SCI3_ERI3=12,
GRP_SCI12_ERI12=12,GRP_RSPI0_SPEI0=12,GRP_RSPI1_SPEI1=12
};

enum enum_gen {
GEN_SCI0_ERI0=12,GEN_SCI1_ERI1=12,GEN_SCI2_ERI2=12,GEN_SCI3_ERI3=12,
GEN_SCI12_ERI12=12,GEN_RSPI0_SPEI0=12,GEN_RSPI1_SPEI1=12
};

#define	IEN_BSC_BUSERR		IEN0
#define	IEN_FCU_FIFERR		IEN5
#define	IEN_FCU_FRDYI		IEN7
#define	IEN_ICU_SWINT		IEN3
#define	IEN_CMT0_CMI0		IEN4
#define	IEN_CMT1_CMI1		IEN5
#define	IEN_CMT2_CMI2		IEN6
#define	IEN_CMT3_CMI3		IEN7
#define	IEN_USB0_D0FIFO0	IEN1
#define	IEN_USB0_D1FIFO0	IEN2
#define	IEN_USB0_USBI0		IEN3
#define	IEN_CAC_FERRF		IEN4
#define	IEN_CAC_MENDF		IEN5
#define	IEN_CAC_OVFF		IEN6
#define	IEN_RSPI0_SPRI0		IEN7
#define	IEN_RSPI0_SPTI0		IEN0
#define	IEN_RSPI0_SPII0		IEN1
#define	IEN_RSPI1_SPRI1		IEN2
#define	IEN_RSPI1_SPTI1		IEN3
#define	IEN_RSPI1_SPII1		IEN4
#define	IEN_CAN1_RXF1		IEN5
#define	IEN_CAN1_TXF1		IEN6
#define	IEN_CAN1_RXM1		IEN7
#define	IEN_CAN1_TXM1		IEN0
#define	IEN_GPT7_GTCIA7		IEN1
#define	IEN_GPT7_GTCIB7		IEN2
#define	IEN_GPT7_GTCIC7		IEN3
#define	IEN_GPT7_GTCIE7		IEN4
#define	IEN_GPT7_GTCIV7		IEN5
#define	IEN_CMP_CMP4		IEN6
#define	IEN_CMP_CMP5		IEN7
#define	IEN_CMP_CMP6		IEN0
#define	IEN_DOC_DOPCF		IEN1
#define	IEN_DPC_RBI0		IEN2
#define	IEN_DPC_RBI1		IEN3
#define	IEN_DPC_RBI2		IEN4
#define	IEN_DPC_RBI3		IEN5
#define	IEN_DPC_RBI4		IEN6
#define	IEN_ICU_IRQ0		IEN0
#define	IEN_ICU_IRQ1		IEN1
#define	IEN_ICU_IRQ2		IEN2
#define	IEN_ICU_IRQ3		IEN3
#define	IEN_ICU_IRQ4		IEN4
#define	IEN_ICU_IRQ5		IEN5
#define	IEN_ICU_IRQ6		IEN6
#define	IEN_ICU_IRQ7		IEN7
#define	IEN_USB_USBR0		IEN2
#define	IEN_AD_ADI0			IEN2
#define	IEN_S12AD_S12ADI0	IEN6
#define	IEN_S12AD_S12GBADI0	IEN7
#define	IEN_S12AD1_S12ADI1	IEN0
#define	IEN_S12AD1_S12GBADI1	IEN1
#define	IEN_ICU_GROUP0		IEN2
#define	IEN_ICU_GROUP12		IEN2
#define	IEN_SCI12_SCIX0		IEN2
#define	IEN_SCI12_SCIX1		IEN3
#define	IEN_SCI12_SCIX2		IEN4
#define	IEN_SCI12_SCIX3		IEN5
#define	IEN_MTU0_TGIA0		IEN6
#define	IEN_MTU0_TGIB0		IEN7
#define	IEN_MTU0_TGIC0		IEN0
#define	IEN_MTU0_TGID0		IEN1
#define	IEN_MTU0_TCIV0		IEN2
#define	IEN_MTU0_TGIE0		IEN3
#define	IEN_MTU0_TGIF0		IEN4
#define	IEN_MTU1_TGIA1		IEN5
#define	IEN_MTU1_TGIB1		IEN6
#define	IEN_MTU1_TCIV1		IEN7
#define	IEN_MTU1_TCIU1		IEN0
#define	IEN_MTU2_TGIA2		IEN1
#define	IEN_MTU2_TGIB2		IEN2
#define	IEN_MTU2_TCIV2		IEN3
#define	IEN_MTU2_TCIU2		IEN4
#define	IEN_MTU3_TGIA3		IEN5
#define	IEN_MTU3_TGIB3		IEN6
#define	IEN_MTU3_TGIC3		IEN7
#define	IEN_MTU3_TGID3		IEN0
#define	IEN_MTU3_TCIV3		IEN1
#define	IEN_MTU4_TGIA4		IEN2
#define	IEN_MTU4_TGIB4		IEN3
#define	IEN_MTU4_TGIC4		IEN4
#define	IEN_MTU4_TGID4		IEN5
#define	IEN_MTU4_TCIV4		IEN6
#define	IEN_MTU5_TGIU5		IEN7
#define	IEN_MTU5_TGIV5		IEN0
#define	IEN_MTU5_TGIW5		IEN1
#define	IEN_MTU6_TGIA6		IEN2
#define	IEN_MTU6_TGIB6		IEN3
#define	IEN_MTU6_TGIC6		IEN4
#define	IEN_MTU6_TGID6		IEN5
#define	IEN_MTU6_TCIV6		IEN6
#define	IEN_MTU7_TGIA7		IEN1
#define	IEN_MTU7_TGIB7		IEN2
#define	IEN_MTU7_TGIC7		IEN3
#define	IEN_MTU7_TGID7		IEN4
#define	IEN_MTU7_TCIV7		IEN5
#define	IEN_POE_OEI1		IEN6
#define	IEN_POE_OEI2		IEN7
#define	IEN_POE_OEI3		IEN0
#define	IEN_POE_OEI4		IEN1
#define	IEN_POE_OEI5		IEN2
#define	IEN_CMP_CMP0		IEN3
#define	IEN_CMP_CMP1		IEN4
#define	IEN_CMP_CMP2		IEN5
#define	IEN_GPT4_GTCIA4		IEN6
#define	IEN_GPT4_GTCIB4		IEN7
#define	IEN_GPT4_GTCIC4		IEN0
#define	IEN_GPT4_GTCIE4		IEN1
#define	IEN_GPT4_GTCIV4		IEN2
#define	IEN_GPT4_LOCOI4		IEN3
#define	IEN_GPT5_GTCIA5		IEN4
#define	IEN_GPT5_GTCIB5		IEN5
#define	IEN_GPT5_GTCIC5		IEN6
#define	IEN_GPT5_GTCIE5		IEN7
#define	IEN_GPT5_GTCIV5		IEN0
#define	IEN_GPT6_GTCIA6		IEN1
#define	IEN_GPT6_GTCIB6		IEN2
#define	IEN_GPT6_GTCIC6		IEN3
#define	IEN_GPT6_GTCIE6		IEN4
#define	IEN_GPT6_GTCIV6		IEN5
#define	IEN_RIIC1_EEI1		IEN6
#define	IEN_RIIC1_RXI1		IEN7
#define	IEN_RIIC1_TXI1		IEN0
#define	IEN_RIIC1_TEI1		IEN1
#define	IEN_RIIC0_EEI0		IEN2
#define	IEN_RIIC0_RXI0		IEN3
#define	IEN_RIIC0_TXI0		IEN4
#define	IEN_RIIC0_TEI0		IEN5
#define	IEN_DMAC_DMAC0I		IEN6
#define	IEN_DMAC_DMAC1I		IEN7
#define	IEN_DMAC_DMAC2I		IEN0
#define	IEN_DMAC_DMAC3I		IEN1
#define	IEN_SCI0_RXI0		IEN6
#define	IEN_SCI0_TXI0		IEN7
#define	IEN_SCI0_TEI0		IEN0
#define	IEN_SCI1_RXI1		IEN1
#define	IEN_SCI1_TXI1		IEN2
#define	IEN_SCI1_TEI1		IEN3
#define	IEN_SCI2_RXI2		IEN4
#define	IEN_SCI2_TXI2		IEN5
#define	IEN_SCI2_TEI2		IEN6
#define	IEN_SCI3_RXI3		IEN7
#define	IEN_SCI3_TXI3		IEN0
#define	IEN_SCI3_TEI3		IEN1
#define	IEN_GPT0_GTCIA0		IEN2
#define	IEN_GPT0_GTCIB0		IEN3
#define	IEN_GPT0_GTCIC0		IEN4
#define	IEN_GPT0_GTCIE0		IEN5
#define	IEN_GPT0_GTCIV0		IEN6
#define	IEN_GPT0_LOCOI0		IEN7
#define	IEN_GPT1_GTCIA1		IEN0
#define	IEN_GPT1_GTCIB1		IEN1
#define	IEN_GPT1_GTCIC1		IEN2
#define	IEN_GPT1_GTCIE1		IEN3
#define	IEN_GPT1_GTCIV1		IEN4
#define	IEN_GPT2_GTCIA2		IEN6
#define	IEN_GPT2_GTCIB2		IEN7
#define	IEN_GPT2_GTCIC2		IEN0
#define	IEN_GPT2_GTCIE2		IEN1
#define	IEN_GPT2_GTCIV2		IEN2
#define	IEN_GPT3_GTCIA3		IEN4
#define	IEN_GPT3_GTCIB3		IEN5
#define	IEN_GPT3_GTCIC3		IEN6
#define	IEN_GPT3_GTCIE3		IEN7
#define	IEN_GPT3_GTCIV3		IEN0
#define	IEN_SCI12_RXI12		IEN2
#define	IEN_SCI12_TXI12		IEN3
#define	IEN_SCI12_TEI12		IEN4

#define	VECT_BSC_BUSERR		16
#define	VECT_FCU_FIFERR		21
#define	VECT_FCU_FRDYI		23
#define	VECT_ICU_SWINT		27
#define	VECT_CMT0_CMI0		28
#define	VECT_CMT1_CMI1		29
#define	VECT_CMT2_CMI2		30
#define	VECT_CMT3_CMI3		31
#define	VECT_USB0_D0FIFO0	33
#define	VECT_USB0_D1FIFO0	34
#define	VECT_USB0_USBI0		35
#define	VECT_CAC_FERRF		36
#define	VECT_CAC_MENDF		37
#define	VECT_CAC_OVFF		38
#define	VECT_RSPI0_SPRI0	39
#define	VECT_RSPI0_SPTI0	40
#define	VECT_RSPI0_SPII0	41
#define	VECT_RSPI1_SPRI1	42
#define	VECT_RSPI1_SPTI1	43
#define	VECT_RSPI1_SPII1	44
#define	VECT_CAN1_RXF1		45
#define	VECT_CAN1_TXF1		46
#define	VECT_CAN1_RXM1		47
#define	VECT_CAN1_TXM1		48
#define	VECT_GPT7_GTCIA7	49
#define	VECT_GPT7_GTCIB7	50
#define	VECT_GPT7_GTCIC7	51
#define	VECT_GPT7_GTCIE7	52
#define	VECT_GPT7_GTCIV7	53
#define	VECT_CMP_CMP4		54
#define	VECT_CMP_CMP5		55
#define	VECT_CMP_CMP6		56
#define	VECT_DOC_DOPCF		57
#define	VECT_DPC_RBI0		58
#define	VECT_DPC_RBI1		59
#define	VECT_DPC_RBI2		60
#define	VECT_DPC_RBI3		61
#define	VECT_DPC_RBI4		62
#define	VECT_ICU_IRQ0		64
#define	VECT_ICU_IRQ1		65
#define	VECT_ICU_IRQ2		66
#define	VECT_ICU_IRQ3		67
#define	VECT_ICU_IRQ4		68
#define	VECT_ICU_IRQ5		69
#define	VECT_ICU_IRQ6		70
#define	VECT_ICU_IRQ7		71
#define	VECT_USB_USBR0		90
#define	VECT_AD_ADI0		98
#define	VECT_S12AD_S12ADI0	102
#define	VECT_S12AD_S12GBADI0	103
#define	VECT_S12AD1_S12ADI1	104
#define	VECT_S12AD1_S12GBADI1	105
#define	VECT_ICU_GROUP0		106
#define	VECT_ICU_GROUP12	114
#define	VECT_SCI12_SCIX0	122
#define	VECT_SCI12_SCIX1	123
#define	VECT_SCI12_SCIX2	124
#define	VECT_SCI12_SCIX3	125
#define	VECT_MTU0_TGIA0		126
#define	VECT_MTU0_TGIB0		127
#define	VECT_MTU0_TGIC0		128
#define	VECT_MTU0_TGID0		129
#define	VECT_MTU0_TCIV0		130
#define	VECT_MTU0_TGIE0		131
#define	VECT_MTU0_TGIF0		132
#define	VECT_MTU1_TGIA1		133
#define	VECT_MTU1_TGIB1		134
#define	VECT_MTU1_TCIV1		135
#define	VECT_MTU1_TCIU1		136
#define	VECT_MTU2_TGIA2		137
#define	VECT_MTU2_TGIB2		138
#define	VECT_MTU2_TCIV2		139
#define	VECT_MTU2_TCIU2		140
#define	VECT_MTU3_TGIA3		141
#define	VECT_MTU3_TGIB3		142
#define	VECT_MTU3_TGIC3		143
#define	VECT_MTU3_TGID3		144
#define	VECT_MTU3_TCIV3		145
#define	VECT_MTU4_TGIA4		146
#define	VECT_MTU4_TGIB4		147
#define	VECT_MTU4_TGIC4		148
#define	VECT_MTU4_TGID4		149
#define	VECT_MTU4_TCIV4		150
#define	VECT_MTU5_TGIU5		151
#define	VECT_MTU5_TGIV5		152
#define	VECT_MTU5_TGIW5		153
#define	VECT_MTU6_TGIA6		154
#define	VECT_MTU6_TGIB6		155
#define	VECT_MTU6_TGIC6		156
#define	VECT_MTU6_TGID6		157
#define	VECT_MTU6_TCIV6		158
#define	VECT_MTU7_TGIA7		161
#define	VECT_MTU7_TGIB7		162
#define	VECT_MTU7_TGIC7		163
#define	VECT_MTU7_TGID7		164
#define	VECT_MTU7_TCIV7		165
#define	VECT_POE_OEI1		166
#define	VECT_POE_OEI2		167
#define	VECT_POE_OEI3		168
#define	VECT_POE_OEI4		169
#define	VECT_POE_OEI5		170
#define	VECT_CMP_CMP0		171
#define	VECT_CMP_CMP1		172
#define	VECT_CMP_CMP2		173
#define	VECT_GPT4_GTCIA4	174
#define	VECT_GPT4_GTCIB4	175
#define	VECT_GPT4_GTCIC4	176
#define	VECT_GPT4_GTCIE4	177
#define	VECT_GPT4_GTCIV4	178
#define	VECT_GPT4_LOCOI4	179
#define	VECT_GPT5_GTCIA5	180
#define	VECT_GPT5_GTCIB5	181
#define	VECT_GPT5_GTCIC5	182
#define	VECT_GPT5_GTCIE5	183
#define	VECT_GPT5_GTCIV5	184
#define	VECT_GPT6_GTCIA6	185
#define	VECT_GPT6_GTCIB6	186
#define	VECT_GPT6_GTCIC6	187
#define	VECT_GPT6_GTCIE6	188
#define	VECT_GPT6_GTCIV6	189
#define	VECT_RIIC1_EEI1		190
#define	VECT_RIIC1_RXI1		191
#define	VECT_RIIC1_TXI1		192
#define	VECT_RIIC1_TEI1		193
#define	VECT_RIIC0_EEI0		194
#define	VECT_RIIC0_RXI0		195
#define	VECT_RIIC0_TXI0		196
#define	VECT_RIIC0_TEI0		197
#define	VECT_DMAC_DMAC0I	198
#define	VECT_DMAC_DMAC1I	199
#define	VECT_DMAC_DMAC2I	200
#define	VECT_DMAC_DMAC3I	201
#define	VECT_SCI0_RXI0		214
#define	VECT_SCI0_TXI0		215
#define	VECT_SCI0_TEI0		216
#define	VECT_SCI1_RXI1		217
#define	VECT_SCI1_TXI1		218
#define	VECT_SCI1_TEI1		219
#define	VECT_SCI2_RXI2		220
#define	VECT_SCI2_TXI2		221
#define	VECT_SCI2_TEI2		222
#define	VECT_SCI3_RXI3		223
#define	VECT_SCI3_TXI3		224
#define	VECT_SCI3_TEI3		225
#define	VECT_GPT0_GTCIA0	226
#define	VECT_GPT0_GTCIB0	227
#define	VECT_GPT0_GTCIC0	228
#define	VECT_GPT0_GTCIE0	229
#define	VECT_GPT0_GTCIV0	230
#define	VECT_GPT0_LOCOI0	231
#define	VECT_GPT1_GTCIA1	232
#define	VECT_GPT1_GTCIB1	233
#define	VECT_GPT1_GTCIC1	234
#define	VECT_GPT1_GTCIE1	235
#define	VECT_GPT1_GTCIV1	236
#define	VECT_GPT2_GTCIA2	238
#define	VECT_GPT2_GTCIB2	239
#define	VECT_GPT2_GTCIC2	240
#define	VECT_GPT2_GTCIE2	241
#define	VECT_GPT2_GTCIV2	242
#define	VECT_GPT3_GTCIA3	244
#define	VECT_GPT3_GTCIB3	245
#define	VECT_GPT3_GTCIC3	246
#define	VECT_GPT3_GTCIE3	247
#define	VECT_GPT3_GTCIV3	248
#define	VECT_SCI12_RXI12	250
#define	VECT_SCI12_TXI12	251
#define	VECT_SCI12_TEI12	252

