cma-1982/githubtest_190602/r_bsp/mcu/rx63t/register_access/iodefine_rx63th.h
#define	MSTP_DMAC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC0	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC1	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC2	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC3	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DTC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_S12ADC	SYSTEM.MSTPCRA.BIT.MSTPA24
#define	MSTP_AD		SYSTEM.MSTPCRA.BIT.MSTPA23
#define	MSTP_DA		SYSTEM.MSTPCRA.BIT.MSTPA19
#define	MSTP_S12ADB0	SYSTEM.MSTPCRA.BIT.MSTPA17
#define	MSTP_S12ADB1	SYSTEM.MSTPCRA.BIT.MSTPA16
#define	MSTP_CMT0	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT1	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT2	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_CMT3	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_MTU	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU0	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU1	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU2	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU3	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU4	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU5	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU6	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU7	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_GPT0	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPT1	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPT2	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPT3	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPT4	SYSTEM.MSTPCRA.BIT.MSTPA6
#define	MSTP_GPT5	SYSTEM.MSTPCRA.BIT.MSTPA6
#define	MSTP_GPT6	SYSTEM.MSTPCRA.BIT.MSTPA6
#define	MSTP_GPT7	SYSTEM.MSTPCRA.BIT.MSTPA6
#define	MSTP_SCI0	SYSTEM.MSTPCRB.BIT.MSTPB31
#define	MSTP_SMCI0	SYSTEM.MSTPCRB.BIT.MSTPB31
#define	MSTP_SCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SMCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SCI2	SYSTEM.MSTPCRB.BIT.MSTPB29
#define	MSTP_SMCI2	SYSTEM.MSTPCRB.BIT.MSTPB29
#define	MSTP_SCI3	SYSTEM.MSTPCRB.BIT.MSTPB28
#define	MSTP_SMCI3	SYSTEM.MSTPCRB.BIT.MSTPB28
#define	MSTP_CRC	SYSTEM.MSTPCRB.BIT.MSTPB23
#define	MSTP_RIIC0	SYSTEM.MSTPCRB.BIT.MSTPB21
#define	MSTP_RIIC1	SYSTEM.MSTPCRB.BIT.MSTPB20
#define	MSTP_USB0	SYSTEM.MSTPCRB.BIT.MSTPB19
#define	MSTP_RSPI0	SYSTEM.MSTPCRB.BIT.MSTPB17
#define	MSTP_RSPI1	SYSTEM.MSTPCRB.BIT.MSTPB16
#define	MSTP_DOC	SYSTEM.MSTPCRB.BIT.MSTPB6
#define	MSTP_SCI12	SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_SMCI12	SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_CAN1	SYSTEM.MSTPCRB.BIT.MSTPB1
#define	MSTP_DPC	SYSTEM.MSTPCRC.BIT.MSTPC31
#define	MSTP_CAC	SYSTEM.MSTPCRC.BIT.MSTPC19
#define	MSTP_RAM0	SYSTEM.MSTPCRC.BIT.MSTPC0

#define	IS_SCI0_ERI0		IS0
#define	IS_SCI1_ERI1		IS1
#define	IS_SCI2_ERI2		IS2
#define	IS_SCI3_ERI3		IS3
#define	IS_SCI12_ERI12		IS4
#define	IS_RSPI0_SPEI0		IS5
#define	IS_RSPI1_SPEI1		IS6

#define	EN_SCI0_ERI0		EN0
#define	EN_SCI1_ERI1		EN1
#define	EN_SCI2_ERI2		EN2
#define	EN_SCI3_ERI3		EN3
#define	EN_SCI12_ERI12		EN4
#define	EN_RSPI0_SPEI0		EN5
#define	EN_RSPI1_SPEI1		EN6

#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	__IS( x )		ICU.GRP[ GRP ## x ].BIT.IS ## x
#define	 _IS( x )		__IS( x )
#define	  IS( x , y )	_IS( _ ## x ## _ ## y )
#define	__EN( x )		ICU.GEN[ GEN ## x ].BIT.EN ## x
#define	 _EN( x )		__EN( x )
#define	  EN( x , y )	_EN( _ ## x ## _ ## y )

#define TMOCNTL SARL0
#define TMOCNTU SARU0

#define	AD0		(*(volatile struct st_ad      __evenaccess *)0x89800)
#define	BSC		(*(volatile struct st_bsc     __evenaccess *)0x81300)
#define	CAC		(*(volatile struct st_cac     __evenaccess *)0x8B000)
#define	CAN1	(*(volatile struct st_can     __evenaccess *)0x91200)
#define	CMT		(*(volatile struct st_cmt     __evenaccess *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0    __evenaccess *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0    __evenaccess *)0x88008)
#define	CMT2	(*(volatile struct st_cmt0    __evenaccess *)0x88012)
#define	CMT3	(*(volatile struct st_cmt0    __evenaccess *)0x88018)
#define	CRC		(*(volatile struct st_crc     __evenaccess *)0x88280)
#define	DA		(*(volatile struct st_da      __evenaccess *)0x880C0)
#define	DMAC	(*(volatile struct st_dmac    __evenaccess *)0x82200)
#define	DMAC0	(*(volatile struct st_dmac0   __evenaccess *)0x82000)
#define	DMAC1	(*(volatile struct st_dmac1   __evenaccess *)0x82040)
#define	DMAC2	(*(volatile struct st_dmac1   __evenaccess *)0x82080)
#define	DMAC3	(*(volatile struct st_dmac1   __evenaccess *)0x820C0)
#define	DOC		(*(volatile struct st_doc     __evenaccess *)0x8B080)
#define	DTC		(*(volatile struct st_dtc     __evenaccess *)0x82400)
#define	FLASH	(*(volatile struct st_flash   __evenaccess *)0x8C296)
#define	GPT		(*(volatile struct st_gpt     __evenaccess *)0xC2000)
#define	GPTB	(*(volatile struct st_gpt     __evenaccess *)0xC2800)
#define	GPT0	(*(volatile struct st_gpt0    __evenaccess *)0xC2100)
#define	GPT1	(*(volatile struct st_gpt1    __evenaccess *)0xC2180)
#define	GPT2	(*(volatile struct st_gpt2    __evenaccess *)0xC2200)
#define	GPT3	(*(volatile struct st_gpt3    __evenaccess *)0xC2280)
#define	GPT4	(*(volatile struct st_gpt4    __evenaccess *)0xC2900)
#define	GPT5	(*(volatile struct st_gpt4    __evenaccess *)0xC2980)
#define	GPT6	(*(volatile struct st_gpt4    __evenaccess *)0xC2A00)
#define	GPT7	(*(volatile struct st_gpt4    __evenaccess *)0xC2A80)
#define	ICU		(*(volatile struct st_icu     __evenaccess *)0x87000)
#define	IWDT	(*(volatile struct st_iwdt    __evenaccess *)0x88030)
#define	MPC		(*(volatile struct st_mpc     __evenaccess *)0x8C100)
#define	MPU		(*(volatile struct st_mpu     __evenaccess *)0x86400)
#define	MTU		(*(volatile struct st_mtu     __evenaccess *)0xC120A)
#define	MTU0	(*(volatile struct st_mtu0    __evenaccess *)0xC1300)
#define	MTU1	(*(volatile struct st_mtu1    __evenaccess *)0xC1380)
#define	MTU2	(*(volatile struct st_mtu2    __evenaccess *)0xC1400)
#define	MTU3	(*(volatile struct st_mtu3    __evenaccess *)0xC1200)
#define	MTU4	(*(volatile struct st_mtu4    __evenaccess *)0xC1200)
#define	MTU5	(*(volatile struct st_mtu5    __evenaccess *)0xC1C80)
#define	MTU6	(*(volatile struct st_mtu3    __evenaccess *)0xC1A00)
#define	MTU7	(*(volatile struct st_mtu7    __evenaccess *)0xC1A00)
#define	POE		(*(volatile struct st_poe     __evenaccess *)0x8C4C0)
#define	PORT	(*(volatile struct st_port    __evenaccess *)0x8C0F2)
#define	PORT0	(*(volatile struct st_port0   __evenaccess *)0x8C000)
#define	PORT1	(*(volatile struct st_port1   __evenaccess *)0x8C001)
#define	PORT2	(*(volatile struct st_port2   __evenaccess *)0x8C002)
#define	PORT3	(*(volatile struct st_port3   __evenaccess *)0x8C003)
#define	PORT4	(*(volatile struct st_port4   __evenaccess *)0x8C044)
#define	PORT5	(*(volatile struct st_port5   __evenaccess *)0x8C045)
#define	PORT6	(*(volatile struct st_port6   __evenaccess *)0x8C046)
#define	PORT7	(*(volatile struct st_port7   __evenaccess *)0x8C007)
#define	PORT8	(*(volatile struct st_port8   __evenaccess *)0x8C008)
#define	PORT9	(*(volatile struct st_port9   __evenaccess *)0x8C009)
#define	PORTA	(*(volatile struct st_porta   __evenaccess *)0x8C00A)
#define	PORTB	(*(volatile struct st_portb   __evenaccess *)0x8C00B)
#define	PORTC	(*(volatile struct st_portc   __evenaccess *)0x8C04C)
#define	PORTD	(*(volatile struct st_portd   __evenaccess *)0x8C00D)
#define	PORTE	(*(volatile struct st_porte   __evenaccess *)0x8C00E)
#define	PORTF	(*(volatile struct st_portf   __evenaccess *)0x8C00F)
#define	PORTG	(*(volatile struct st_portg   __evenaccess *)0x8C010)
#define	RIIC0	(*(volatile struct st_riic    __evenaccess *)0x88300)
#define	RIIC1	(*(volatile struct st_riic    __evenaccess *)0x88320)
#define	RSPI0	(*(volatile struct st_rspi    __evenaccess *)0x88380)
#define	RSPI1	(*(volatile struct st_rspi    __evenaccess *)0x883A0)
#define	S12ADB0	(*(volatile struct st_s12adb  __evenaccess *)0x89000)
#define	S12ADB1	(*(volatile struct st_s12adb  __evenaccess *)0x89100)
#define	SCI0	(*(volatile struct st_sci0    __evenaccess *)0x8A000)
#define	SCI1	(*(volatile struct st_sci0    __evenaccess *)0x8A020)
#define	SCI2	(*(volatile struct st_sci0    __evenaccess *)0x8A040)
#define	SCI3	(*(volatile struct st_sci0    __evenaccess *)0x8A060)
#define	SCI12	(*(volatile struct st_sci12   __evenaccess *)0x8B300)
#define	SMCI0	(*(volatile struct st_smci    __evenaccess *)0x8A000)
#define	SMCI1	(*(volatile struct st_smci    __evenaccess *)0x8A020)
#define	SMCI2	(*(volatile struct st_smci    __evenaccess *)0x8A040)
#define	SMCI3	(*(volatile struct st_smci    __evenaccess *)0x8A060)
#define	SMCI12	(*(volatile struct st_smci    __evenaccess *)0x8B300)
#define	SYSTEM	(*(volatile struct st_system  __evenaccess *)0x80000)
#define	USB0	(*(volatile struct st_usb     __evenaccess *)0xA0000)
#define	WDT		(*(volatile struct st_wdt     __evenaccess *)0x88020)
#pragma bit_order
#pragma packoption
#endif
